---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDir1Generic
source: html/c3e5fbbd-ec65-34a2-536d-5f124719a762.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDir1Generic Property

"Top/Exterior Major Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesTopDir1Generic { get; }
```